{
    "navigation": {
        "curriculum": "Curriculum", 
        "english": "English", 
        "portuguese": "Portuguese"
    },
    "about": {
        "tag": "about me", 
        "title": "About me and my tech journey.", 
        "text": "Yo! I'm André Gonçalves, a 22 years old software designer/developer and a tech enthusiast. My first contact with software development was in 2017, when I started studying at the technical school IFC (a federal institute in my state).", 
        "more": " Back in these days, I made my first website for a homework, the class was just about HTML but I started learning JS and CSS cause I wanted to do a beauty and functional website. My teacher gave me a 0 and told me to redo using HTML exactly the way he asked to. I think it was a important lesson: first to don't rush the learning proccess and second to use tools that the project needs, don't overuse solutions that no contributes to the final result. IFC formed me as a Web Developer (my actual occupation area), but I have infinity interest areas besides it: cyber security, AI, automations, hardware... I'd love to explore all tech sides cause at first look it feels like magic, you don't understand what's happening, but then you study about it, dive deep and you reveal how the trick is done.",
        "button": "Tell me everything..."
    },
    "skills": {
        "tag": "skills", 
        "title": "All my tech skills leveled (by me btw)",
        "advanced": "Advanced",
        "intermediate": "Intermediate",
        "english": "English (write, \nread & listen)",
        "englishtalk": "English talking",
        "more": " While studying on IFC I learned the most basic tools for a complete web system development: HTML, JS/jQuery, PHP and MySQL. Also had some introduction classes about some other languages and frameworks like Angular, Nodejs and Bootstrap. On my first job (IPM Systems), in a period of two years and a half, I was part of the team that developed a web system for management of cities health centers using the same technologies I had learned, which make me master HTML, JS/jQuery, PHP and MySQL. On my second job (NxFácil) I learned PostgreSQL, which have a different syntax comparing to MySQL, and I develop two systems in parallel, an ERP using native PHP on backend and Bootstrap with jQuery on frontend and a project management software (like Trello), also uses the same front but with Laravel as backend. I developed a Whatsapp API to use in these two softwares using NodeJS and a library called puppeteer, also did an API for third party software consume and insert data in the ERP using Laravel and documented it with Postman. Also I'm responsible for controlling and maintaining the servers, gaving me skills with Linux, servers and AWS Management. The other skills I acquired through self-taught study.",
        "button": "Show me details..."
    },
    "experiences": {
        "tag1": "experiences",
        "tag2": "timeline",
        "title": "Places where I developed my skills",
        "school": "Education",
        "ifc": "IFC (federal institute)\nInformation Technology\n2017 - 2019",
        "jobs": "Jobs",
        "ipm": "IPM Systems\nFullstack Dev\nfeb 2020 - jul 2022",
        "nxfacil": "NxFácil\nFullcycle Dev\njul 2022 - until now",
        "more": " IPM was my first job, I started doing a free course that they're doing and they hired me because of my good performance at this course. Used in practice the languages i've learned on IFC. Desigred my role as \"Fullstack\" cause I did developed both front and backend. On NxFácil I also use the previously learned technologies but also others that I don't had any contact and learned how to use while I developed (technical details in the skills tab). Desigred my function as \"Fullcycle\" cause different from fullstack, here I take care of the entire software cycle: requirements analysis and gathering, developing front and backend and also deploying the system, because I'm responsible for the servers too. This work gave me a big bag of knowledge (and responsibilities too). ",
        "button": "Explain me these...'"
    },
    "button-back": "Go back..."
}